print(int("42"), str(42))           #перетворення із строки в строку
print(repr(42))                     #перетворення в строку в тому вигляді, як вона представлена в коді

S = "42"
I = 1
#print(S + I)                       #буде помилка
print(int(S) + I)                   #додавання
print(S + str(I))                   #конкатенація

print(str(3.1415), float("1.5"))
text = "1.234E-10"
print(float(text))

print(ord('s'))
print(chr(115))

S = '5'
S = chr(ord(S) + 1)
print(S)
S = chr(ord(S) + 1)
print(S)

B = '1101'                          #перетворення двійкових цифр в ціле чиле число зза допомогою ord
I = 0
while B != '':
    I = I * 2 + (ord(B[0]) - ord('0'))
    B = B[1:]
print(I)

print(int('1101', 2))               #перетворення строки двійкових цифр в ціле число: вбудована функція
print(bin(13))                      #перетворення цілого числа в строку двійкових цифр: вбудована функція